from fastapi import FastAPI
from typing import List, Dict


app = FastAPI()

# فرض کنید اطلاعات مداحی‌ها در یک دیکشنری ذخیره شده‌اند
# هر مداحی دارای نام خواننده، نام مداحی و مدت زمان است
# اطلاعات مداحی‌ها را در این دیکشنری تعریف کنید
mock_maddahi_data = [
    {
        "id": "1",
        "name": "نمیدانم",
        "singer": "علیمی",
        "duration": "10:41",
        "img": 'img/10.jpg',
        "audio": "madahi/1/1.mp3",
        # سایر مشخصات مداحی
    },
    {
        "id": "2",
        "name": " ",
        "singer": "علیمی",
        "duration": "5:50",
        # سایر مشخصاتی

    },
    {
        "id": "3",
        "name": " ",
        "singer": "علیمی",
        "duration": "5:11",
        # سایر مشخصاتی

    },
    {"id": "4",
        "name": " ",
     "singer": "علیمی",
        "duration": "8:09",
        # سایر مشخصاتی

     },
    {
        "id": "5",
        "name": " ",
        "singer": "علیمی",
        "duration": "2:56",
        # سایر مشخصاتی

    },
    {
        "id": "6",
        "name": "بریم نجف",
        "singer": "امیر کرمانشاهی",
        "duration": "4:08",
        # سایر مشخصاتی

    },
    {
        "id": "7",
        "name": " ",
        "singer": "قلیچ خانی",
        "duration": "2:30",
        # سایر مشخصاتی

    },
    {
        'id': "8",
        "name": " ",
        "singer": "قلیچ خانی",
        "duration": "3:24",
        # سایر مشخصاتی

    },
    {
        "id": "9",
        "name": " ",
        "singer": "قلیچ خانی",
        "duration": "3:30",
        # سایر مشخصاتی

    },
    {
        "id": "10",
        "name": " ",
        "singer": "قلیچ خانی",
        "duration": "2:08",
        # سایر مشخصاتی

    },
    {
        "id": "11",
        "name": " ",
        "singer": "قلیچ خانی",
        "duration": "3:32",
        # سایر مشخصاتی

    },
    {
        "id": "12",
        "name": " ",
        "singer": "قلیچ خانی",
        "duration": "3:20",
        # سایر مشخصاتی

    },
    {
        "id": "13",
        "name": " ",
        "singer": "هلالی",
        "duration": "5:32",
        # سایر مشخصاتی

    },
    {
        "id": "14",
        "name": " ",
        "singer": "هلالی",
        "duration": "37:00",
        # سایر مشخصاتی

    },
    {
        "id": "15",
        "name": " ",
        "singer": "هلالی",
        "duration": "4:38",
        # سایر مشخصاتی

    },
    {
        "id": "16",
        "name": " ",
        "singer": "هلالی",
        "duration": "6:49",
        # سایر مشخصاتی

    },
    {
        "id": "17",
        "name": " ",
        "singer": "هلالی",
        "duration": "2:20",
        # سایر مشخصاتی

    },
    {
        "id": "18",
        "name": " ",
        "singer": "هلالی",
        "duration": "2:53",
        # سایر مشخصاتی

    },
    {
        "id": "19",
        "name": "سلام حامیه زندگیم",
        "singer": "حسین خلجی",
        "duration": "3:01",
        # سایر مشخصاتی

    },
    {
        "id": "20",
        "name": "بارون ببار از طاق آسمون",
        "singer": "جواد مقدم",
        "duration": "10:09",
        # سایر مشخصاتی

    },
    {
        "id": "21",
        "name": " ",
        "singer": "محمد کریمی",
        "duration": "3:53",
        # سایر مشخصاتی

    },
    {
        "id": "22",
        "name": " ",
        "singer": "محمد کریمی",
        "duration": "13:06",
        # سایر مشخصاتی

    },
    {
        "id": "23",
        "name": " ",
        "singer": "محمد کریمی",
        "duration": "3:47",
        # سایر مشخصاتی

    },
    {
        "id": "24",
        "name": " ",
        "singer": "محمد کریمی",
        "duration": "3:38",
        # سایر مشخصاتی

    },
    {
        "id": "25",
        "name": " ",
        "singer": "محمد کریمی",
        "duration": "4:12",
        # سایر مشخصاتی

    },
    {
        "id": "26",
        "name": " ",
        "singer": "محمد کریمی",
        "duration": "16:42",
        # سایر مشخصاتی

    },
    {
        "id": "27",
        "name": "سلام من به حسین",
        "singer": "محمد کریمی",
        "duration": "6:35",
        # سایر مشخصاتی

    },
    {
        "id": "28",
        "name": "باید قلبم برای تو حرم بشه",
        "singer": "مجید بنی فاطمه",
        "duration": "7:12",
        # سایر مشخصاتی

    },
    {
        "id": "29",
        "name": "یا علی یا عظیم",
        "singer": "حاج مهدی رسولی",
        "duration": "3:30",
        # سایر مشخصاتی

    },
    {
        "id": "30",
        "name": "عاشق حسینیم به ابلفضل",
        "singer": "میسم متی",
        "duration": "8:05",
        # سایر مشخصاتی

    },
    {
        "id": "31",
        "name": " ",
        "singer": "مقدم",
        "duration": "5:22",
        # سایر مشخصاتی

    },
    {
        "id": "32",
        "name": " ",
        "singer": "مقدم",
        "duration": "4:06",
        # سایر مشخصاتی

    },
    {
        "id": "33",
        "name": " ",
        "singer": "مقدم",
        "duration": "6:57",
        # سایر مشخصاتی

    },
    {
        "id": "34",
        "name": " ",
        "singer": "مقدم",
        "duration": "7:58",
        # سایر مشخصاتی

    },
    {
        "id": "35",
        "name": " ",
        "singer": "مقدم",
        "duration": "5:31",
        # سایر مشخصاتی

    },

    {
        "id": "36",
        "name": " ",
        "singer": "مقدم",
        "duration": "5:40",
        # سایر مشخصاتی

    },
    {
        "id": "37",
        "name": " ",
        "singer": "مقدم",
        "duration": "7:23",
        # سایر مشخصاتی

    },
    {
        "id": "38",
        "name": "عشق یعنی سینه زنم",
        "singer": "محمد حسین پویانفر",
        "duration": "5:36",
        # سایر مشخصاتی

    },
    {
        "id": "39",
        "name": " ",
        "singer": "مختاری",
        "duration": "9:53",
        # سایر مشخصاتی

    },
    {
        "id": "40",
        "name": " ",
        "singer": "مختاری",
        "duration": "34:07",
        # سایر مشخصاتی

    },
    {
        "id": "41",
        "name": " ",
        "singer": "مختاری",
        "duration": "3:19",
        # سایر مشخصاتی

    },
    {
        "id": "42",
        "name": "دنیا محل گذره",
        "singer": "محمد حسین پویانفر",
        "duration": "3:15",
        # سایر مشخصاتی

    },
    {
        "id": "43",
        "name": "نمیشه باورم",
        "singer": "سید رضا نریمانی",
        "duration": "6:16",
        # سایر مشخصاتی

    },
    {
        "id": "44",
        "name": " ",
        "singer": "سیب سرخی",
        "duration": "3:45",
        # سایر مشخصاتی

    },
    {
        "id": "45",
        "name": " ",
        "singer": "سیب سرخی",
        "duration": "6:41",
        # سایر مشخصاتی

    },

    {
        "id": "46",
        "name": " ",
        "singer": "سیب سرخی",
        "duration": "14:33",
        # سایر مشخصاتی

    },
    {
        "id": "47",
        "name": " ",
        "singer": "سیب سرخی",
        "duration": "28:30",
        # سایر مشخصات مداحی
    },
]


@app.get("/maddahi")
def get_maddahi_list() -> List[Dict[str, str]]:
    """
    درخواست GET برای دریافت لیست مداحی‌ها با اطلاعات مربوطه
    """
    return mock_maddahi_data

# می‌توانید روت‌های دیگری برای جزئیات مداحی‌ها ایجاد کنید
# مثلاً برای دریافت اطلاعات یک مداحی خاص

# برای اجرای این API، از دستور زیر استفاده کنید:
# uvicorn main:app --reload
